app/controllers/admin/pages_controller.rb

SELECT "boss_posts".* FROM "boss_posts" LIMIT 5
---
  def index
    @posts = Boss::Post.limit(5)